ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm0h321x/TIMG1_1.0.xml
        <register id="TIMG1_IFCTL_23" width="32" offset="0x88" instances="2" instaddr="0x4" description="Input Filter Control Register 2/3">
            <bitfield id="ISEL" description="Input Select (CCP0)  This field selects the input source to the filter input. 4h-7h = Reserved" begin="3" end="0" width="4" rwaccess="R/W">
                <bitenum id="CCPX_INPUT" value="0x0" description="CCP of the corresponding capture compare unit"/>
                <bitenum id="CCPX_INPUT_PAIR" value="0x1" description="Input pair CCPX of the capture compare unit. For CCP0 input pair is CCP1 and for CCP1 input pair is CCP0."/>
                <bitenum id="CCP0_INPUT" value="0x2" description="CCP0 of the counter"/>
                <bitenum id="TRIG_INPUT" value="0x3" description="Trigger"/>
                <bitenum id="CCP_XOR" value="0x4" description="XOR of CCP inputs as input source (Used in Hall input mode)."/>
                <bitenum id="FSUB0" value="0x5" description="subscriber 0 event as input source."/>
                <bitenum id="FSUB1" value="0x6" description="subscriber 1 event as input source."/>
                <bitenum id="COMP0" value="0x7" description="Comparator 0 output."/>
                <bitenum id="COMP1" value="0x8" description="Comparator 1 output."/>
                <bitenum id="COMP2" value="0x9" description="Comparator 2 output."/>
            </bitfield>
            <bitfield id="INV" description="Input Inversion This bit controls whether the selected input is inverted." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="NOINVERT" value="0x0" description="Noninverted"/>
                <bitenum id="INVERT" value="0x1" description="Inverted"/>
            </bitfield>
            <bitfield id="FP" description="Filter Period. This field specifies the sample period for the
input filter. I.e. The input is sampled for FP
timer clocks during filtering." begin="9" end="8" width="2" rwaccess="R/W">
                <bitenum id="_3" value="0x0" description="The division factor is 3"/>
                <bitenum id="_5" value="0x1" description="The division factor is 5"/>
                <bitenum id="_8" value="0x2" description="The division factor is 8"/>
            </bitfield>
            <bitfield id="CPV" description="Consecutive Period/Voting Select

This bit controls whether the input filter uses a
stricter consecutive period count or majority
voting." begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="Consecutive" value="0x0" description="Consecutive Periods The input must be at a specific logic level for the period defined by FP before it is passed to the filter output."/>
                <bitenum id="Voting" value="0x1" description="Voting  The filter ignores one clock of opposite logic over the filter period. I.e. Over FP samples of the input, up to 1 sample may be of an opposite logic value (glitch) without affecting the output."/>
            </bitfield>
            <bitfield id="FE" description="Filter Enable
This bit controls whether the input is filtered by
the input filter or bypasses to the edge
detect." begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Bypass."/>
                <bitenum id="ENABLED" value="0x1" description="Filtered."/>
            </bitfield>
        </register>
        <register id="TIMG1_PL" width="32" offset="0xA0" description="Phase Load Register">
            <bitfield id="PHASE" description="Phase Load value" begin="15" end="0" width="16" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFFFFFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG1_DBCTL" width="32" offset="0xA4" description="Dead Band insertion control register">
            <bitfield id="RISEDELAY" description="Rise Delay
The number of TIMCLK periods inserted between the fall edge of CCP signal and the rise edge of CCP complimentary signal." begin="11" end="0" width="12" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFFF" description="Maximum Value"/>
            </bitfield>
            <bitfield id="FALLDELAY" description="Fall Delay
The number of TIMCLK periods inserted between the fall edge of CCP signal and the rise edge of CCP complimentary signal." begin="27" end="16" width="12" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFFF" description="Maximum Value"/>
            </bitfield>
            <bitfield id="M1_ENABLE" description="Dead Band Mode 1 Enable." begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Disabled"/>
                <bitenum id="ENABLED" value="0x1" description="Enabled"/>
            </bitfield>
        </register>
        <register id="TIMG1_TSEL" width="32" offset="0xB0" description="Trigger Select Register">
            <bitfield id="ETSEL" description="External Trigger Select. #br# This selects which System Event is used if the input filter selects trigger.  
Triggers 0-15 are used to connect triggers generated by other timer modules. Refer to the SoC datasheet for details related to timer trigger sources.
Triggers 16 and  17 are connected to event manager subscriber ports.
Event lines 18-31 are reserved for future use." begin="4" end="0" width="5" rwaccess="R/W">
                <bitenum id="TRIG0" value="0x0" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG1" value="0x1" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG2" value="0x2" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG3" value="0x3" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG4" value="0x4" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG5" value="0x5" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG6" value="0x6" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG7" value="0x7" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG8" value="0x8" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG9" value="0x9" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG10" value="0xA" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG11" value="0xB" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG12" value="0xC" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG13" value="0xD" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG14" value="0xE" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG15" value="0xF" description="TRIGx = External trigger input from TIM x."/>
                <bitenum id="TRIG_SUB0" value="0x10" description="TRIG_SUBx = External trigger input from subscriber port x."/>
                <bitenum id="TRIG_SUB1" value="0x11" description="TRIG_SUBx = External trigger input from subscriber port x."/>
            </bitfield>
            <bitfield id="TE" description="Trigger Enable.
This selects whether a trigger is enabled or not for this counter  
0x0 = Triggers are not used 
0x1 = Triggers are used as selected by the ETSEL field" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Triggers are not used."/>
                <bitenum id="ENABLED" value="0x1" description="Triggers are used as selected by the IE, ITSEL and ETSEL fields."/>
            </bitfield>
        </register>
        <register id="TIMG1_RC" width="32" offset="0xB4" description="Repeat counter Register">
            <bitfield id="RC" description="Repeat Counter Value" begin="7" end="0" width="8" rwaccess="R">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG1_RCLD" width="32" offset="0xB8" description="Repeat counter load Register">
            <bitfield id="RCLD" description="Repeat Counter Load Value
This field provides the value loaded into the
repeat counter at a load event following the
repeat counter value equaling 0." begin="7" end="0" width="8" rwaccess="R/W">
                <bitenum id="MINIMUM" value="0x0" description="Minimum value"/>
                <bitenum id="MAXIMUM" value="0xFF" description="Maximum Value"/>
            </bitfield>
        </register>
        <register id="TIMG1_FCTL" width="32" offset="0xD0" description="Fault Control Register">
            <bitfield id="FIEN" description="Fault Input Enable
This bit enables the input for fault detection." begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Fault Input Disabled"/>
                <bitenum id="ENABLED" value="0x1" description="Fault Input Enabled"/>
            </bitfield>
            <bitfield id="FI" description="Fault Input
Specifies whether the overall fault condition is dependent on the sensed fault pin." begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="INDEPENDENT" value="0x0" description="Overall Fault condition is not dependent on sensed input."/>
                <bitenum id="DEPENDENT" value="0x1" description="Overall Fault condition is dependent on sensed input."/>
            </bitfield>
            <bitfield id="TFIM" description="Trigger Fault Input Mask
Specifies whether the selected trigger participates as a fault input. If enabled and the trigger asserts, the trigger is treated as a fault." begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="DISABLED" value="0x0" description="Selected trigger does not participate in fault condition generation"/>
                <bitenum id="ENABLED" value="0x1" description="Selected trigger participates in fault condition generation"/>
            </bitfield>
            <bitfield id="FL" description="Fault Latch mode
Specifies whether the fault condition is latched and configures the latch clear conditions." begin="4" end="3" width="2" rwaccess="R/W">
                <bitenum id="NO_LATCH" value="0x0" description="Overall fault condition is not dependent on the F bit in RIS"/>
                <bitenum id="LATCH_SW_CLR" value="0x1" description="Overall fault condition is dependent on the F bit in RIS"/>
                <bitenum id="LATCH_Z_CLR" value="0x2" description="Fault condition is latched. Fault condition is cleared on a zero event if the fault input is 0."/>
                <bitenum id="LATCH_LD_CLR" value="0x3" description="Fault condition is latched. Fault condition is cleared on a load event if the fault input is 0."/>
            </bitfield>
            <bitfield id="FSENAC0" description="Specifies whether the COMP0 output high/low is treated as fault condition." begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
            <bitfield id="FSENAC1" description="Specifies whether the COMP1 output high/low is treated as fault condition." begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
            <bitfield id="FSENAC2" description="Specifies whether the COMP2 output high/low is treated as fault condition." begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
            <bitfield id="FSENEXT0" description="Specifies whether the external fault pin0 high/low is treated as fault condition." begin="11" end="11" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
            <bitfield id="FSENEXT1" description="Specifies whether the external fault pin1 high/low is treated as fault condition." begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
            <bitfield id="FSENEXT2" description="Specifies whether the external fault pin2 high/low is treated as fault condition." begin="13" end="13" width="1" rwaccess="R/W">
                <bitenum id="LOWCTIVE" value="0x0" description="Fault Input is active low."/>
                <bitenum id="HIGHACTIVE" value="0x1" description="Fault Input is active high."/>
            </bitfield>
        </register>
        <register id="TIMG1_FIFCTL" width="32" offset="0xD4" description="Fault input Filter control register">
            <bitfield id="FP" description="Filter Period
This field specifies the sample period for the input filter.  I.e. The input is sampled for FP timer clocks during filtering." begin="1" end="0" width="2" rwaccess="R/W">
                <bitenum id="PER_3" value="0x0" description="Filter Period 3"/>
                <bitenum id="PER_5" value="0x1" description="Filter Period 5"/>
                <bitenum id="PER_8" value="0x2" description="Filter Period 8"/>
            </bitfield>
            <bitfield id="CPV" description="Consecutive Period/Voting Select
This bit controls whether the input filter uses a stricter consecutive period count or majority voting." begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="CONSEC_PER" value="0x0" description="Consecutive Periods. The input must be at a specific logic level for the period defined by FP before it is passed to the filter output."/>
                <bitenum id="VOTING" value="0x1" description="Voting. The filter ignores one clock of opposite logic over the filter period. I.e. Over FP samples of the input, up to 1 sample may be of an opposite logic value (glitch) without affecting the output"/>
            </bitfield>
            <bitfield id="FILTEN" description="Filter Enable
This bit controls whether the input is filtered by the input filter or bypasses to go directly to the optional pre-scale filter and then to the edge detect." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="BYPASS" value="0x0" description="Bypass"/>
                <bitenum id="FILTERED" value="0x1" description="Filtered."/>
            </bitfield>
        </register>
        </group>

</module>